START_TEXT = "Привет"
MAIN_MENU_TEXT = "Нажмите на кнопку:"
ALERTS_TEXT = ("<b>🔔 Оповещения:</b>\n\n"
               "<i>Получайте первыми уведомления о бесплатных слотах на складах Wildberries</i>\n")
CREATE_ALERT_TEXT = ("<b>➕ Создание запроса:</b>\n\n"
                     "<i>Выберите тип оповощения:</i>")
SELECT_WAREHOUSE_TEXT = ("<b>➕ Создание запроса:</b>\n\n"
                         "<i>Выберите склады (можно несколько):</i>")
SELECT_SUPPLY_TYPES_TEXT = ("<b>➕ Создание запроса:</b>\n\n"
                            "<i>Выберите типы поставок (можно несколько):</i>")
SELECT_COEFFICIENT_TEXT = ("<b>➕ Создание запроса:</b>\n\n"
                           "<i>Выберите коэффициент приемки (например если выбрать 1, то система будет искать коэффициенты 1 и меньше):</i>")
SELECT_PERIOD_TEXT = ("<b>➕ Создание запроса:</b>\n\n"
                     "<i>Выберите период поиска:</i>")
SELECT_ALERT_TEXT = ("<b>➕ Создание запроса:</b>\n\n"
                     "<i>Сколько раз вас уведомить? (Например если выбрать до первого уведомления, то система пришлёт первый подходящий под ваши параметры слот и всё)</i>")

FINAL_NOTIFICATION_TEXT = (
    "🚨 <b>ВНИМАНИЕ ВАЖНО!</b>\n\n"
    "<b>Активирование запроса:</b>\n\n"
    "Запрос создан. Но не активирован!\n"
    "Ваш запрос: {warehouse_names} / {period} / {supply_types_names} / меньше {coefficient}\n\n"
    "Уведомления о найденных слотах будут приходить в специальный бот для уведомлений (не в основной бот☝️)\n"
    "На каждый запрос о поиске, системой может быть назначен разный бот☝️!  При этом бот каждый раз нужно запустить!\n\n"
    "☝️☝️☝️ <b>ДЛЯ ЗАПУСКА ПОИСКА, НУЖНО НАЖАТЬ КНОПКУ НИЖЕ И В ОТКРЫВШЕМСЯ БОТЕ НАЖАТЬ КНОПКУ СТАРТ!</b>\n\n"
    "Только тогда система начнёт искать Вам слоты☝️\n\n"
    "УВЕДОМЛЕНИЯ БУДУТ ПРИХОДИТЬ ИМЕННО ОТТУДА! ИЗ ТОГО БОТА!\n\n"
    "НАЖАТЬ КНОПКУ ПЕРЕЙТИ И ЗАПУСТИТЬ и далее в боте запустить бота!\n"
    "⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️⬇️"
)